{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/(IllumioCoreEvent')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "IllumioCoreEvent",
        "category": "Microsoft Sentinel Parser",
        "FunctionAlias": "IllumioCoreEvent",
        "query": "CommonSecurityLog\n| where DeviceVendor =~ 'Illumio'\n| extend EventCount = int(1)\n| extend EventType = coalesce(\n                column_ifexists(\"DeviceEventCategory\", \"\"),\n                extract(@'outcome=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),\n                \"\"\n                )\n        ,EventResult = coalesce(\n                column_ifexists(\"EventOutcome\", \"\"),\n                extract(@'outcome=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),\n                \"\"\n                )\n        ,EventOriginalResultDetails = coalesce(\n                column_ifexists(\"Reason\", \"\"),\n                extract(@'reason=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),\n                \"\"\n                ),\n        SchemaVersion = coalesce(\n                tostring(column_ifexists(\"FieldDeviceCustomNumber2\", long(null))),\n                tostring(column_ifexists(\"DeviceCustomNumber2\",long(null)))\n                ),\n        EventStartTime =  coalesce(\n                StartTime,\n                extract(@'start=(.*?)(?:;|$)',1, AdditionalExtensions,typeof(datetime)),\n                todatetime(ReceiptTime),\n                datetime(null)\n                ),\n        EventEndTime =  coalesce(\n                EndTime,\n                extract(@'end=(.*?)(?:;|$)',1, AdditionalExtensions,typeof(datetime)),\n                todatetime(ReceiptTime),\n                datetime(null)\n                )\n        ,EventOriginalUid = case(DeviceCustomString1Label =~ 'event_href', DeviceCustomString1, '')\n        ,DstVulns = case(DeviceCustomString1Label =~ 'dst_vulns', DeviceCustomString1, '')\n        ,ResourceChanges = case(DeviceCustomString2Label =~ 'resource_changes', DeviceCustomString2, '')\n        ,State = case(DeviceCustomString2Label =~ 'state', DeviceCustomString2, '')\n        ,Notifications = case(DeviceCustomString4Label =~ 'notifications', DeviceCustomString4, '')\n        ,DstLabels = case(DeviceCustomString4Label =~ 'dst_labels', DeviceCustomString4, '')\n        ,DstHref = case(DeviceCustomString6Label =~ 'dst_href', DeviceCustomString6, '')\n| project-rename  EventVendor=DeviceVendor\n                , EventProduct=DeviceProduct\n                , EventProductVersion=DeviceVersion\n                , EventSubType=DeviceEventClassID\n                , EventSeverity=LogSeverity\n                , DvcAction=DeviceAction\n                , NetworkDirection=CommunicationDirection\n                , NetworkProtocol=Protocol\n                , UrlOriginal=RequestURL\n                , HttpRequestMethod=RequestMethod\n                , EventOriginalResult=Activity\n                , DstHostname=DestinationHostName\n                , DstIpAddr=DestinationIP\n                , DstPortNumber=DestinationPort\n                , ActingProcessName=DestinationProcessName\n                , DstUsername=DestinationUserName\n                , Dvc=DeviceName\n                , SrcBytes=SentBytes\n                , EventMessage=Message\n                , DstBytes=ReceivedBytes\n                , SrcIpAddr=SourceIP\n| project-away  AdditionalExtensions\n            ,   DeviceCustomNumber1\n            ,   DeviceCustomNumber1Label\n            ,   DeviceCustomNumber2\n            ,   DeviceCustomNumber2Label\n            ,   DeviceCustomString1\n            ,   DeviceCustomString1Label\n            ,   DeviceCustomString2\n            ,   DeviceCustomString2Label\n            ,   DeviceCustomString3\n            ,   DeviceCustomString3Label\n            ,   DeviceCustomString4\n            ,   DeviceCustomString4Label\n            ,   DeviceCustomString5\n            ,   DeviceCustomString5Label\n            ,   DeviceCustomString6\n            ,   DeviceCustomString6Label\n            ,   DeviceCustomDate1Label\n            ,   DeviceCustomDate1\n            ,   DeviceCustomDate2Label\n            ,   DeviceCustomDate2\n            ,   FlexString1Label\n            ,   FlexString1\n            ,   FlexString2Label\n            ,   FlexString2\n            ,   DeviceCustomFloatingPoint1Label\n            ,   DeviceCustomFloatingPoint1\n            ,   DeviceCustomFloatingPoint2Label\n            ,   DeviceCustomFloatingPoint2\n            ,   DeviceCustomIPv6Address1Label\n            ,   DeviceCustomIPv6Address1\n            ,   DeviceCustomIPv6Address2Label\n            ,   DeviceCustomIPv6Address2\n            ,   DeviceCustomIPv6Address3Label\n            ,   DeviceCustomIPv6Address3\n            ,   SimplifiedDeviceAction\n            ,   OriginalLogSeverity\n            ,   ApplicationProtocol\n            ,   DestinationDnsDomain\n            ,   DestinationServiceName\n            ,   DestinationTranslatedAddress\n            ,   DestinationTranslatedPort\n            ,   DeviceDnsDomain\n            ,   DeviceExternalID\n            ,   DeviceFacility\n            ,   DeviceInboundInterface\n            ,   DeviceNtDomain\n            ,   DeviceOutboundInterface\n            ,   DevicePayloadId\n            ,   ProcessName\n            ,   DeviceTranslatedAddress\n            ,   DestinationMACAddress\n            ,   DestinationNTDomain\n            ,   DestinationProcessId\n            ,   DestinationUserPrivileges\n            ,   DeviceTimeZone\n            ,   DestinationUserID\n            ,   DeviceAddress\n            ,   DeviceMacAddress\n            ,   ProcessID\n            ,   EndTime\n            ,   ExternalID\n            ,   FileCreateTime\n            ,   FileHash\n            ,   FileID\n            ,   FileModificationTime\n            ,   FilePath\n            ,   FilePermission\n            ,   FileType\n            ,   FileName\n            ,   FileSize\n            ,   OldFileCreateTime\n            ,   OldFileHash\n            ,   OldFileID\n            ,   OldFileModificationTime\n            ,   OldFileName\n            ,   OldFilePath\n            ,   OldFilePermission\n            ,   OldFileSize\n            ,   OldFileType\n            ,   ReceiptTime\n            ,   RequestClientApplication\n            ,   RequestContext\n            ,   RequestCookies\n            ,   SourceHostName\n            ,   SourceMACAddress\n            ,   SourceNTDomain\n            ,   SourceDnsDomain\n            ,   SourceServiceName\n            ,   SourceTranslatedAddress\n            ,   SourceTranslatedPort\n            ,   SourceProcessId\n            ,   SourceUserPrivileges\n            ,   SourceProcessName\n            ,   SourcePort\n            ,   StartTime\n            ,   SourceUserID\n            ,   SourceUserName\n            ,   DeviceCustomIPv6Address4\n            ,   DeviceCustomIPv6Address4Label\n            ,   DeviceCustomFloatingPoint3\n            ,   DeviceCustomFloatingPoint3Label\n            ,   DeviceCustomFloatingPoint4\n            ,   DeviceCustomFloatingPoint4Label\n            ,   DeviceCustomNumber3\n            ,   DeviceCustomNumber3Label\n            ,   FlexDate1\n            ,   FlexDate1Label\n            ,   FlexNumber1\n            ,   FlexNumber1Label\n            ,   FlexNumber2\n            ,   FlexNumber2Label\n            ,   RemoteIP\n            ,   RemotePort\n            ,   MaliciousIP\n            ,   ThreatSeverity\n            ,   IndicatorThreatType\n            ,   ThreatDescription\n            ,   ThreatConfidence\n            ,   ReportReferenceLink\n            ,   MaliciousIPLongitude\n            ,   MaliciousIPLatitude\n            ,   MaliciousIPCountry\n",
        "version": 1,
        "tags": []
      }
    }
  ]
}
