{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/(CitrixADCEventOld')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CitrixADCEventOld",
        "category": "Microsoft Sentinel Parser",
        "FunctionAlias": "CitrixADCEventOld",
        "query": "CommonSecurityLog\n| where DeviceVendor =~ \"Citrix\" \n| where DeviceProduct =~ \"NetScaler\"\n| extend EventCount = int(1)\n        ,EventType = coalesce(\n                Activity,\n                column_ifexists(\"DeviceEventCategory\", \"\"),\n                extract(@'outcome=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),\n                \"\"\n                )\n        ,HttpRequestMethod = coalesce(\n                RequestMethod,\n                extract(@'method=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),\n                \"\"\n                )\n        ,OriginalLogSeverity = DeviceCustomString4\n| project-rename  EventVendor=DeviceVendor\n                , EventProduct=DeviceProduct\n                , EventProductVersion=DeviceVersion\n                , EventSeverity=LogSeverity\n                , Module=DeviceEventClassID\n                , DvcAction=DeviceAction\n                , UrlOriginal=RequestURL\n                , SrcIpAddr=SourceIP\n                , SrcPortNumber=SourcePort\n                , EventOriginalType=DeviceCustomNumber1\n                , HttpTransactionId=DeviceCustomNumber2\n                , ProfileName=DeviceCustomString1\n                , PPEId=DeviceCustomString2\n                , SessionId=DeviceCustomString3\n                , EventYear=DeviceCustomString5\n| project-away Activity\n            ,  AdditionalExtensions\n            ,  ApplicationProtocol\n            ,  DestinationDnsDomain\n            ,  DestinationServiceName\n            ,  DestinationTranslatedAddress\n            ,  DestinationTranslatedPort\n            ,  CommunicationDirection\n            ,  DeviceDnsDomain\n            ,  DeviceExternalID\n            ,  DeviceFacility\n            ,  DeviceInboundInterface\n            ,  DeviceNtDomain\n            ,  DeviceOutboundInterface\n            ,  DevicePayloadId\n            ,  ProcessName\n            ,  DeviceTranslatedAddress\n            ,  DestinationHostName\n            ,  DestinationMACAddress\n            ,  DestinationNTDomain\n            ,  DestinationProcessId\n            ,  DestinationUserPrivileges\n            ,  DestinationProcessName\n            ,  DestinationPort\n            ,  DestinationIP\n            ,  DeviceTimeZone\n            ,  DestinationUserID\n            ,  DestinationUserName\n            ,  DeviceAddress\n            ,  DeviceName\n            ,  DeviceMacAddress\n            ,  ProcessID\n            ,  EndTime\n            ,  ExternalID\n            ,  FileCreateTime\n            ,  FileHash\n            ,  FileID\n            ,  FileModificationTime\n            ,  FilePath\n            ,  FilePermission\n            ,  FileType\n            ,  FileName\n            ,  FileSize\n            ,  SimplifiedDeviceAction\n            ,  ReceivedBytes\n            ,  Message\n            ,  OldFileCreateTime\n            ,  OldFileHash\n            ,  OldFileID\n            ,  OldFileModificationTime\n            ,  OldFileName\n            ,  OldFilePath\n            ,  OldFilePermission\n            ,  OldFileSize\n            ,  OldFileType\n            ,  SentBytes\n            ,  Protocol\n            ,  RequestClientApplication\n            ,  RequestContext\n            ,  RequestCookies\n            ,  RequestMethod\n            ,  ReceiptTime\n            ,  SourceHostName\n            ,  SourceMACAddress\n            ,  SourceNTDomain\n            ,  SourceDnsDomain\n            ,  SourceServiceName\n            ,  SourceTranslatedAddress\n            ,  SourceTranslatedPort\n            ,  SourceProcessId\n            ,  SourceUserPrivileges\n            ,  SourceProcessName\n            ,  StartTime\n            ,  SourceUserID\n            ,  SourceUserName\n            ,  DeviceCustomIPv6Address1\n            ,  DeviceCustomIPv6Address1Label\n            ,  DeviceCustomIPv6Address2\n            ,  DeviceCustomIPv6Address2Label\n            ,  DeviceCustomIPv6Address3\n            ,  DeviceCustomIPv6Address3Label\n            ,  DeviceCustomIPv6Address4\n            ,  DeviceCustomIPv6Address4Label\n            ,  DeviceCustomFloatingPoint1\n            ,  DeviceCustomFloatingPoint1Label\n            ,  DeviceCustomFloatingPoint2\n            ,  DeviceCustomFloatingPoint2Label\n            ,  DeviceCustomFloatingPoint3\n            ,  DeviceCustomFloatingPoint3Label\n            ,  DeviceCustomFloatingPoint4\n            ,  DeviceCustomFloatingPoint4Label\n            ,  DeviceCustomNumber1Label\n            ,  DeviceCustomNumber2Label\n            ,  DeviceCustomNumber3\n            ,  DeviceCustomNumber3Label\n            ,  DeviceCustomString1Label\n            ,  DeviceCustomString2Label\n            ,  DeviceCustomString3Label\n            ,  DeviceCustomString4\n            ,  DeviceCustomString4Label\n            ,  DeviceCustomString5Label\n            ,  DeviceCustomString6\n            ,  DeviceCustomString6Label\n            ,  DeviceCustomDate1\n            ,  DeviceCustomDate1Label\n            ,  DeviceCustomDate2\n            ,  DeviceCustomDate2Label\n            ,  FlexDate1\n            ,  FlexDate1Label\n            ,  FlexNumber1\n            ,  FlexNumber1Label\n            ,  FlexNumber2\n            ,  FlexNumber2Label\n            ,  FlexString1\n            ,  FlexString1Label\n            ,  FlexString2\n            ,  FlexString2Label\n            ,  RemoteIP\n            ,  RemotePort\n            ,  MaliciousIP\n            ,  ThreatSeverity\n            ,  IndicatorThreatType\n            ,  ThreatDescription\n            ,  ThreatConfidence\n            ,  ReportReferenceLink\n            ,  MaliciousIPLongitude\n            ,  MaliciousIPLatitude\n            ,  MaliciousIPCountry\n",
        "version": 1,
        "tags": []
      }
    }
  ]
}
