{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/(CiscoSEGEvent')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CiscoSEGEvent",
        "category": "Microsoft Sentinel Parser",
        "FunctionAlias": "CiscoSEGEvent",
        "query": "CommonSecurityLog\n| where DeviceEventClassID =~ 'ESA_CONSOLIDATED_LOG_EVENT'\n| parse-kv AdditionalExtensions as (startTime:string, endTime:string, ESAAttachmentDetails:string) with (pair_delimiter=';', kv_delimiter='=')\n| parse-kv AdditionalExtensions as (ESAMID:int, ESAICID:int, ESADCID:int, ESAAMPVerdict:string, ESAASVerdict:string, ESAAVVerdict:string, ESACFVerdict:string, ESADLPVerdict:string, ESADMARCVerdict:string, ESAFriendlyFrom:string, ESAGMVerdict:string, ESAMailFlowPolicy:string, ESAMFVerdict:string, ESAOFVerdict:string, ESAHeloDomain:string, ESAReplyTo:string, ESASDRDomainAge:string, ESASPFVerdict:string, sourceHostName:string, sourceAddress:string, ESATLSInConnStatus:string, ESATLSInProtocol:string, ESATLSOutConnStatus:string) with (pair_delimiter=';', kv_delimiter='=')\n| parse AdditionalExtensions with * \"ESAGMVerdict\" ESAGMVerdict\";\" *\n| extend NetworkDirection = case(CommunicationDirection == '0', 'Incoming', 'Outgoing')\n| parse ESAAttachmentDetails with * \"'fileHash': '\" FileHashSha256\"'},\" *\n| project-rename EventStartTime = startTime\n\t\t\t   , EventEndTime = endTime\n\t\t\t   , EventVendor = DeviceVendor\n               , EventProduct = DeviceProduct\n               , EventId = DeviceEventClassID\n               , EventSeverity = LogSeverity\n               , DvcAction = DeviceAction\n               , DvcIpAddr = DeviceAddress\n               , EventMessage = Message\n               , EventProductVersion = DeviceVersion\n               , SerialNumber = DeviceExternalID\n               , DvcInboundInterface = DeviceInboundInterface\n               , DvcOutboundInterface = DeviceOutboundInterface\n               , DstUserName = DestinationUserName\n               , SrcUserName = SourceUserName\n               , MailPolicy = DeviceCustomString1\n               , SrcGeoCountry = DeviceCustomString2\n               , ThreatCategory = DeviceCustomString3\n               , EventOriginalUid = DeviceCustomString4\n               , MailLanguage = DeviceCustomString5\n               , SdrRepScore = DeviceCustomString6\n               , SbrsScore = DeviceCustomFloatingPoint1\n| project-away Activity\n             , DeviceCustomString1Label\n             , DeviceCustomString2Label\n             , DeviceCustomString3Label\n             , DeviceCustomString4Label\n             , DeviceCustomString5Label\n             , DeviceCustomString6Label\n             , DeviceCustomFloatingPoint1Label\n             , AdditionalExtensions\n",
        "version": 1,
        "tags": []
      }
    }
  ]
}
