{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/(Devicefromip')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Devicefromip",
        "category": "Microsoft Sentinel Parser",
        "FunctionAlias": "Devicefromip",
        "query": "let DeviceFromIP2 = (T:(IP:string), Timestamp:datetime = datetime(null))\n{\nlet t = coalesce(Timestamp, now());\nlet lastReportIds = DeviceNetworkInfo \n    | where Timestamp between(max_of(t - 1d, ago(30d)) .. t)\n    | summarize arg_max(Timestamp, ReportId) by DeviceId;\nlet adapters = DeviceNetworkInfo\n    | where Timestamp between(max_of(t - 1d, ago(30d)) .. t)\n    | lookup kind = inner lastReportIds on ReportId, DeviceId\n    | mv-expand todynamic(IPAddresses)\n    | project DeviceId, IP = tostring(IPAddresses.IPAddress);\nT | join adapters on IP | project-away IP1\n};\n",
        "version": 1,
        "tags": []
      }
    }
  ]
}
